
// Написать программу, которая из имеющегося массива строк, длина которых меньше либо равна 3 символа. Первоналаьный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительно массивами.
// 1. Создать GitHub
// 2. Написать блок-схему алгоритма (можно обойтись блок-схемой основной содержательной части, если вы выделяете ее в отдельный метод)
// 3. Снабдить репозиторий оформленным текстовым описанием решения (фаел README.md)
// 4. Написать программу, решающую поставленную задачу
// 5. Использовать больше 4 коммитов

// [hello, 2, world, :-)]
// [1234, 1567, -2, computer sciense]
// [Russia, Denmark, Kazan]

Console.Clear();

